# StackedWallNeedsUnjoin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..StackedWallNeedsUnjoin Property
BuiltInFailures..::..WallFailures Class See Also
---
A subwall of this stacked wall is unjoined from its neighbors because it was pulled too far.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StackedWallNeedsUnjoin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StackedWallNeedsUnjoin As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StackedWallNeedsUnjoin {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace